// Query to detect file sharing platforms (e.g., uTorrent, BitTorrent) using Defender ATP

DeviceFileEvents
| where FolderPath contains "\\AppData\\Roaming\\uTorrent\\" or
        FolderPath contains "\\AppData\\Roaming\\BitTorrent\\" or
        FolderPath contains "\\AppData\\Local\\BitTorrent\\" or
        FolderPath contains "\\AppData\\Local\\uTorrent\\"
| project Timestamp, ActionType, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine
