// Query to detect file sharing platforms (e.g., uTorrent, BitTorrent) using Defender ATP

DeviceFileEvents
| where FolderPath contains "\\AppData\\Roaming\\uTorrent\\" or
        FolderPath contains "\\AppData\\Roaming\\BitTorrent\\" or
        FolderPath contains "\\AppData\\Local\\BitTorrent\\" or
        FolderPath contains "\\AppData\\Local\\uTorrent\\"
| project Timestamp, ActionType, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine


SigninLogs
| where TimeGenerated >= ago(90d)
| summarize LastSignIn = max(TimeGenerated) by UserId
| join kind=leftouter (
    AuditLogs
    | where OperationName == "PasswordReset"
) on UserId
| where LastSignIn < ago(90d) and isnull(OperationName)
| project UserId, LastSignIn, UserPrincipalName


// Sentinel query to track file writes to USB drives

DeviceFileEvents
| where ActionType == "Write"  // Filter for file write actions
| where DeviceType == "RemovableDisk"  // Filter for removable disks (USB drives)
| project Timestamp, ActionType, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, DeviceName


DeviceRegistryEvents
| where RegistryValueName matches regex @"password|pass|pwd|credential"
| where ActionType == "RegistryValueSet" or ActionType == "RegistryValueModified"
| project Timestamp, DeviceName, RegistryKey, RegistryValueName, RegistryValueData

